#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.repository["tool-simulation"].github_repository_file.files[".gitignore"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.gitignore.tftpl
            
            # Generated by Cargo
            # will have compiled files and executables
            debug/
            target/
            
            *.env
            
            # Local cargo cache generated by make targets
            .cargo/registry
            
            
            .cargo/registry
            
            
            # Libraries should ignore Cargo.lock
            # Executables should track Cargo.lock
            # More information here https://doc.rust-lang.org/cargo/guide/cargo-toml-vs-cargo-lock.html
            
            
            # These are backup files generated by rustfmt
            **/*.rs.bk
            
            # MSVC Windows builds of rustc generate these, which store debugging information
            *.pdb
            
            # Don't add vscode or idea meta files
            .vscode
            .idea
            
            # Don't add DS_Store
            .DS_Store
        EOT
      + file                = ".gitignore"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "tool-simulation"
      + sha                 = (known after apply)
    }

  # module.repository["tool-simulation"].github_repository_file.files["Makefile"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
          - # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/Makefile
          + # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/Makefile.tftpl
            
            DOCKER_NAME := arrow-tool-simulation
            
          - help: .help-base .help-cspell .help-markdown .help-editorconfig
          + # Combined targets
            
          + IMAGE_NAME   := tool-simulation
          + PACKAGE_NAME := $(IMAGE_NAME)
          + DOCKER_PORT  := 8000
          + HOST_PORT    := 3000
          + 
          + help: .help-base .help-rust .help-python .help-cspell .help-markdown .help-editorconfig .help-toml .help-docker
          + build: rust-build docker-build
          + all: test build release
          + 
          + include .make/docker.mk
          + 
          + release: rust-release
          + test: rust-test-all cspell-test toml-test python-test md-test-links editorconfig-test
          + tidy: rust-tidy toml-tidy python-tidy
          + 
            include .make/base.mk
            include .make/cspell.mk
            include .make/markdown.mk
            include .make/editorconfig.mk
          - 
          - test: cspell-test md-test-links editorconfig-test
          + include .make/toml.mk
          + include .make/rust.mk
          + include .make/python.mk
        EOT
        id                  = "tool-simulation/Makefile"
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

```

</details>

*Pusher: @ServiceDog, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*